In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [3]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [6]:
#Drops any rows with an Nan value in it
#Irrespective if there are values in others
df.dropna()

     A    B  C
0  1.0  5.0  1

In [7]:
#Drops any columns with an Nan value in it
#Irrespective if there are values in others
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [8]:
# Keep row if it has at least 2 non-NaN values
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [9]:
#Fill in Nan Value with custom value
df.fillna(value='FILL VALUE')

            A           B  C
0         1.0         5.0  1
1         2.0  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [10]:
#Alternatively fill in Nan Value with a Mean Value
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64